GopalSaraf/Practicals/PSDL/include/proc/pic16f1773.inc
// Register: COG1BLKR
#define COG1BLKR COG1BLKR
COG1BLKR                                 equ 068Fh
// bitfield definitions
COG1BLKR_BLKR_POSN                       equ 0000h
COG1BLKR_BLKR_POSITION                   equ 0000h
COG1BLKR_BLKR_SIZE                       equ 0006h
COG1BLKR_BLKR_LENGTH                     equ 0006h
COG1BLKR_BLKR_MASK                       equ 003Fh
COG1BLKR_BLKR0_POSN                      equ 0000h
COG1BLKR_BLKR0_POSITION                  equ 0000h
COG1BLKR_BLKR0_SIZE                      equ 0001h
COG1BLKR_BLKR0_LENGTH                    equ 0001h
COG1BLKR_BLKR0_MASK                      equ 0001h
COG1BLKR_BLKR1_POSN                      equ 0001h
COG1BLKR_BLKR1_POSITION                  equ 0001h
COG1BLKR_BLKR1_SIZE                      equ 0001h
COG1BLKR_BLKR1_LENGTH                    equ 0001h
COG1BLKR_BLKR1_MASK                      equ 0002h
COG1BLKR_BLKR2_POSN                      equ 0002h
COG1BLKR_BLKR2_POSITION                  equ 0002h
COG1BLKR_BLKR2_SIZE                      equ 0001h
COG1BLKR_BLKR2_LENGTH                    equ 0001h
COG1BLKR_BLKR2_MASK                      equ 0004h
COG1BLKR_BLKR3_POSN                      equ 0003h
COG1BLKR_BLKR3_POSITION                  equ 0003h
COG1BLKR_BLKR3_SIZE                      equ 0001h
COG1BLKR_BLKR3_LENGTH                    equ 0001h
COG1BLKR_BLKR3_MASK                      equ 0008h
COG1BLKR_BLKR4_POSN                      equ 0004h
COG1BLKR_BLKR4_POSITION                  equ 0004h
COG1BLKR_BLKR4_SIZE                      equ 0001h
COG1BLKR_BLKR4_LENGTH                    equ 0001h
COG1BLKR_BLKR4_MASK                      equ 0010h
COG1BLKR_BLKR5_POSN                      equ 0005h
COG1BLKR_BLKR5_POSITION                  equ 0005h
COG1BLKR_BLKR5_SIZE                      equ 0001h
COG1BLKR_BLKR5_LENGTH                    equ 0001h
COG1BLKR_BLKR5_MASK                      equ 0020h
COG1BLKR_G1BLKR0_POSN                    equ 0000h
COG1BLKR_G1BLKR0_POSITION                equ 0000h
COG1BLKR_G1BLKR0_SIZE                    equ 0001h
COG1BLKR_G1BLKR0_LENGTH                  equ 0001h
COG1BLKR_G1BLKR0_MASK                    equ 0001h
COG1BLKR_G1BLKR1_POSN                    equ 0001h
COG1BLKR_G1BLKR1_POSITION                equ 0001h
COG1BLKR_G1BLKR1_SIZE                    equ 0001h
COG1BLKR_G1BLKR1_LENGTH                  equ 0001h
COG1BLKR_G1BLKR1_MASK                    equ 0002h
COG1BLKR_G1BLKR2_POSN                    equ 0002h
COG1BLKR_G1BLKR2_POSITION                equ 0002h
COG1BLKR_G1BLKR2_SIZE                    equ 0001h
COG1BLKR_G1BLKR2_LENGTH                  equ 0001h
COG1BLKR_G1BLKR2_MASK                    equ 0004h
COG1BLKR_G1BLKR3_POSN                    equ 0003h
COG1BLKR_G1BLKR3_POSITION                equ 0003h
COG1BLKR_G1BLKR3_SIZE                    equ 0001h
COG1BLKR_G1BLKR3_LENGTH                  equ 0001h
COG1BLKR_G1BLKR3_MASK                    equ 0008h
COG1BLKR_G1BLKR4_POSN                    equ 0004h
COG1BLKR_G1BLKR4_POSITION                equ 0004h
COG1BLKR_G1BLKR4_SIZE                    equ 0001h
COG1BLKR_G1BLKR4_LENGTH                  equ 0001h
COG1BLKR_G1BLKR4_MASK                    equ 0010h
COG1BLKR_G1BLKR5_POSN                    equ 0005h
COG1BLKR_G1BLKR5_POSITION                equ 0005h
COG1BLKR_G1BLKR5_SIZE                    equ 0001h
COG1BLKR_G1BLKR5_LENGTH                  equ 0001h
COG1BLKR_G1BLKR5_MASK                    equ 0020h

// Register: COG1BLKF
#define COG1BLKF COG1BLKF
COG1BLKF                                 equ 0690h
// bitfield definitions
COG1BLKF_BLKF_POSN                       equ 0000h
COG1BLKF_BLKF_POSITION                   equ 0000h
COG1BLKF_BLKF_SIZE                       equ 0006h
COG1BLKF_BLKF_LENGTH                     equ 0006h
COG1BLKF_BLKF_MASK                       equ 003Fh
COG1BLKF_BLKF0_POSN                      equ 0000h
COG1BLKF_BLKF0_POSITION                  equ 0000h
COG1BLKF_BLKF0_SIZE                      equ 0001h
COG1BLKF_BLKF0_LENGTH                    equ 0001h
COG1BLKF_BLKF0_MASK                      equ 0001h
COG1BLKF_BLKF1_POSN                      equ 0001h
COG1BLKF_BLKF1_POSITION                  equ 0001h
COG1BLKF_BLKF1_SIZE                      equ 0001h
COG1BLKF_BLKF1_LENGTH                    equ 0001h
COG1BLKF_BLKF1_MASK                      equ 0002h
COG1BLKF_BLKF2_POSN                      equ 0002h
COG1BLKF_BLKF2_POSITION                  equ 0002h
COG1BLKF_BLKF2_SIZE                      equ 0001h
COG1BLKF_BLKF2_LENGTH                    equ 0001h
COG1BLKF_BLKF2_MASK                      equ 0004h
COG1BLKF_BLKF3_POSN                      equ 0003h
COG1BLKF_BLKF3_POSITION                  equ 0003h
COG1BLKF_BLKF3_SIZE                      equ 0001h
COG1BLKF_BLKF3_LENGTH                    equ 0001h
COG1BLKF_BLKF3_MASK                      equ 0008h
COG1BLKF_BLKF4_POSN                      equ 0004h
COG1BLKF_BLKF4_POSITION                  equ 0004h
COG1BLKF_BLKF4_SIZE                      equ 0001h
COG1BLKF_BLKF4_LENGTH                    equ 0001h
COG1BLKF_BLKF4_MASK                      equ 0010h
COG1BLKF_BLKF5_POSN                      equ 0005h
COG1BLKF_BLKF5_POSITION                  equ 0005h
COG1BLKF_BLKF5_SIZE                      equ 0001h
COG1BLKF_BLKF5_LENGTH                    equ 0001h
COG1BLKF_BLKF5_MASK                      equ 0020h
COG1BLKF_G1BLKF0_POSN                    equ 0000h
COG1BLKF_G1BLKF0_POSITION                equ 0000h
COG1BLKF_G1BLKF0_SIZE                    equ 0001h
COG1BLKF_G1BLKF0_LENGTH                  equ 0001h
COG1BLKF_G1BLKF0_MASK                    equ 0001h
COG1BLKF_G1BLKF1_POSN                    equ 0001h
COG1BLKF_G1BLKF1_POSITION                equ 0001h
COG1BLKF_G1BLKF1_SIZE                    equ 0001h
COG1BLKF_G1BLKF1_LENGTH                  equ 0001h
COG1BLKF_G1BLKF1_MASK                    equ 0002h
COG1BLKF_G1BLKF2_POSN                    equ 0002h
COG1BLKF_G1BLKF2_POSITION                equ 0002h
COG1BLKF_G1BLKF2_SIZE                    equ 0001h
COG1BLKF_G1BLKF2_LENGTH                  equ 0001h
COG1BLKF_G1BLKF2_MASK                    equ 0004h
COG1BLKF_G1BLKF3_POSN                    equ 0003h
COG1BLKF_G1BLKF3_POSITION                equ 0003h
COG1BLKF_G1BLKF3_SIZE                    equ 0001h
COG1BLKF_G1BLKF3_LENGTH                  equ 0001h
COG1BLKF_G1BLKF3_MASK                    equ 0008h
COG1BLKF_G1BLKF4_POSN                    equ 0004h
COG1BLKF_G1BLKF4_POSITION                equ 0004h
COG1BLKF_G1BLKF4_SIZE                    equ 0001h
COG1BLKF_G1BLKF4_LENGTH                  equ 0001h
COG1BLKF_G1BLKF4_MASK                    equ 0010h
COG1BLKF_G1BLKF5_POSN                    equ 0005h
COG1BLKF_G1BLKF5_POSITION                equ 0005h
COG1BLKF_G1BLKF5_SIZE                    equ 0001h
COG1BLKF_G1BLKF5_LENGTH                  equ 0001h
COG1BLKF_G1BLKF5_MASK                    equ 0020h

// Register: COG1DBR
#define COG1DBR COG1DBR
COG1DBR                                  equ 0691h
// bitfield definitions
COG1DBR_DBR_POSN                         equ 0000h
COG1DBR_DBR_POSITION                     equ 0000h
COG1DBR_DBR_SIZE                         equ 0006h
COG1DBR_DBR_LENGTH                       equ 0006h
COG1DBR_DBR_MASK                         equ 003Fh
COG1DBR_DBR0_POSN                        equ 0000h
COG1DBR_DBR0_POSITION                    equ 0000h
COG1DBR_DBR0_SIZE                        equ 0001h
COG1DBR_DBR0_LENGTH                      equ 0001h
COG1DBR_DBR0_MASK                        equ 0001h
COG1DBR_DBR1_POSN                        equ 0001h
COG1DBR_DBR1_POSITION                    equ 0001h
COG1DBR_DBR1_SIZE                        equ 0001h
COG1DBR_DBR1_LENGTH                      equ 0001h
COG1DBR_DBR1_MASK                        equ 0002h
COG1DBR_DBR2_POSN                        equ 0002h
COG1DBR_DBR2_POSITION                    equ 0002h
COG1DBR_DBR2_SIZE                        equ 0001h
COG1DBR_DBR2_LENGTH                      equ 0001h
COG1DBR_DBR2_MASK                        equ 0004h
COG1DBR_DBR3_POSN                        equ 0003h
COG1DBR_DBR3_POSITION                    equ 0003h
COG1DBR_DBR3_SIZE                        equ 0001h
COG1DBR_DBR3_LENGTH                      equ 0001h
COG1DBR_DBR3_MASK                        equ 0008h
COG1DBR_DBR4_POSN                        equ 0004h
COG1DBR_DBR4_POSITION                    equ 0004h
COG1DBR_DBR4_SIZE                        equ 0001h
COG1DBR_DBR4_LENGTH                      equ 0001h
COG1DBR_DBR4_MASK                        equ 0010h
COG1DBR_DBR5_POSN                        equ 0005h
COG1DBR_DBR5_POSITION                    equ 0005h
COG1DBR_DBR5_SIZE                        equ 0001h
COG1DBR_DBR5_LENGTH                      equ 0001h
COG1DBR_DBR5_MASK                        equ 0020h
COG1DBR_G1DBR0_POSN                      equ 0000h
COG1DBR_G1DBR0_POSITION                  equ 0000h
COG1DBR_G1DBR0_SIZE                      equ 0001h
COG1DBR_G1DBR0_LENGTH                    equ 0001h
COG1DBR_G1DBR0_MASK                      equ 0001h
COG1DBR_G1DBR1_POSN                      equ 0001h
COG1DBR_G1DBR1_POSITION                  equ 0001h
COG1DBR_G1DBR1_SIZE                      equ 0001h
COG1DBR_G1DBR1_LENGTH                    equ 0001h
COG1DBR_G1DBR1_MASK                      equ 0002h
COG1DBR_G1DBR2_POSN                      equ 0002h
COG1DBR_G1DBR2_POSITION                  equ 0002h
COG1DBR_G1DBR2_SIZE                      equ 0001h
COG1DBR_G1DBR2_LENGTH                    equ 0001h
COG1DBR_G1DBR2_MASK                      equ 0004h
COG1DBR_G1DBR3_POSN                      equ 0003h
COG1DBR_G1DBR3_POSITION                  equ 0003h
COG1DBR_G1DBR3_SIZE                      equ 0001h
COG1DBR_G1DBR3_LENGTH                    equ 0001h
COG1DBR_G1DBR3_MASK                      equ 0008h
COG1DBR_G1DBR4_POSN                      equ 0004h
COG1DBR_G1DBR4_POSITION                  equ 0004h
COG1DBR_G1DBR4_SIZE                      equ 0001h
COG1DBR_G1DBR4_LENGTH                    equ 0001h
COG1DBR_G1DBR4_MASK                      equ 0010h
COG1DBR_G1DBR5_POSN                      equ 0005h
COG1DBR_G1DBR5_POSITION                  equ 0005h
COG1DBR_G1DBR5_SIZE                      equ 0001h
COG1DBR_G1DBR5_LENGTH                    equ 0001h
COG1DBR_G1DBR5_MASK                      equ 0020h

