GopalSaraf/Practicals/PSDL/include/proc/pic16f1773.inc
// Register: CM6CON0
#define CM6CON0 CM6CON0
CM6CON0                                  equ 0914h
// bitfield definitions
CM6CON0_SYNC_POSN                        equ 0000h
CM6CON0_SYNC_POSITION                    equ 0000h
CM6CON0_SYNC_SIZE                        equ 0001h
CM6CON0_SYNC_LENGTH                      equ 0001h
CM6CON0_SYNC_MASK                        equ 0001h
CM6CON0_HYS_POSN                         equ 0001h
CM6CON0_HYS_POSITION                     equ 0001h
CM6CON0_HYS_SIZE                         equ 0001h
CM6CON0_HYS_LENGTH                       equ 0001h
CM6CON0_HYS_MASK                         equ 0002h
CM6CON0_ZLF_POSN                         equ 0003h
CM6CON0_ZLF_POSITION                     equ 0003h
CM6CON0_ZLF_SIZE                         equ 0001h
CM6CON0_ZLF_LENGTH                       equ 0001h
CM6CON0_ZLF_MASK                         equ 0008h
CM6CON0_POL_POSN                         equ 0004h
CM6CON0_POL_POSITION                     equ 0004h
CM6CON0_POL_SIZE                         equ 0001h
CM6CON0_POL_LENGTH                       equ 0001h
CM6CON0_POL_MASK                         equ 0010h
CM6CON0_OUT_POSN                         equ 0006h
CM6CON0_OUT_POSITION                     equ 0006h
CM6CON0_OUT_SIZE                         equ 0001h
CM6CON0_OUT_LENGTH                       equ 0001h
CM6CON0_OUT_MASK                         equ 0040h
CM6CON0_ON_POSN                          equ 0007h
CM6CON0_ON_POSITION                      equ 0007h
CM6CON0_ON_SIZE                          equ 0001h
CM6CON0_ON_LENGTH                        equ 0001h
CM6CON0_ON_MASK                          equ 0080h
CM6CON0_C6SYNC_POSN                      equ 0000h
CM6CON0_C6SYNC_POSITION                  equ 0000h
CM6CON0_C6SYNC_SIZE                      equ 0001h
CM6CON0_C6SYNC_LENGTH                    equ 0001h
CM6CON0_C6SYNC_MASK                      equ 0001h
CM6CON0_C6HYS_POSN                       equ 0001h
CM6CON0_C6HYS_POSITION                   equ 0001h
CM6CON0_C6HYS_SIZE                       equ 0001h
CM6CON0_C6HYS_LENGTH                     equ 0001h
CM6CON0_C6HYS_MASK                       equ 0002h
CM6CON0_C6SP_POSN                        equ 0002h
CM6CON0_C6SP_POSITION                    equ 0002h
CM6CON0_C6SP_SIZE                        equ 0001h
CM6CON0_C6SP_LENGTH                      equ 0001h
CM6CON0_C6SP_MASK                        equ 0004h
CM6CON0_C6ZLF_POSN                       equ 0003h
CM6CON0_C6ZLF_POSITION                   equ 0003h
CM6CON0_C6ZLF_SIZE                       equ 0001h
CM6CON0_C6ZLF_LENGTH                     equ 0001h
CM6CON0_C6ZLF_MASK                       equ 0008h
CM6CON0_C6POL_POSN                       equ 0004h
CM6CON0_C6POL_POSITION                   equ 0004h
CM6CON0_C6POL_SIZE                       equ 0001h
CM6CON0_C6POL_LENGTH                     equ 0001h
CM6CON0_C6POL_MASK                       equ 0010h
CM6CON0_C6OUT_POSN                       equ 0006h
CM6CON0_C6OUT_POSITION                   equ 0006h
CM6CON0_C6OUT_SIZE                       equ 0001h
CM6CON0_C6OUT_LENGTH                     equ 0001h
CM6CON0_C6OUT_MASK                       equ 0040h
CM6CON0_C6ON_POSN                        equ 0007h
CM6CON0_C6ON_POSITION                    equ 0007h
CM6CON0_C6ON_SIZE                        equ 0001h
CM6CON0_C6ON_LENGTH                      equ 0001h
CM6CON0_C6ON_MASK                        equ 0080h

// Register: CM6CON1
#define CM6CON1 CM6CON1
CM6CON1                                  equ 0915h
// bitfield definitions
CM6CON1_INTN_POSN                        equ 0000h
CM6CON1_INTN_POSITION                    equ 0000h
CM6CON1_INTN_SIZE                        equ 0001h
CM6CON1_INTN_LENGTH                      equ 0001h
CM6CON1_INTN_MASK                        equ 0001h
CM6CON1_INTP_POSN                        equ 0001h
CM6CON1_INTP_POSITION                    equ 0001h
CM6CON1_INTP_SIZE                        equ 0001h
CM6CON1_INTP_LENGTH                      equ 0001h
CM6CON1_INTP_MASK                        equ 0002h
CM6CON1_C6INTN_POSN                      equ 0000h
CM6CON1_C6INTN_POSITION                  equ 0000h
CM6CON1_C6INTN_SIZE                      equ 0001h
CM6CON1_C6INTN_LENGTH                    equ 0001h
CM6CON1_C6INTN_MASK                      equ 0001h
CM6CON1_C6INTP_POSN                      equ 0001h
CM6CON1_C6INTP_POSITION                  equ 0001h
CM6CON1_C6INTP_SIZE                      equ 0001h
CM6CON1_C6INTP_LENGTH                    equ 0001h
CM6CON1_C6INTP_MASK                      equ 0002h

// Register: CM6NSEL
#define CM6NSEL CM6NSEL
CM6NSEL                                  equ 0916h
// bitfield definitions
CM6NSEL_NCH_POSN                         equ 0000h
CM6NSEL_NCH_POSITION                     equ 0000h
CM6NSEL_NCH_SIZE                         equ 0004h
CM6NSEL_NCH_LENGTH                       equ 0004h
CM6NSEL_NCH_MASK                         equ 000Fh
CM6NSEL_C6NCH_POSN                       equ 0000h
CM6NSEL_C6NCH_POSITION                   equ 0000h
CM6NSEL_C6NCH_SIZE                       equ 0004h
CM6NSEL_C6NCH_LENGTH                     equ 0004h
CM6NSEL_C6NCH_MASK                       equ 000Fh
CM6NSEL_C6NCH0_POSN                      equ 0000h
CM6NSEL_C6NCH0_POSITION                  equ 0000h
CM6NSEL_C6NCH0_SIZE                      equ 0001h
CM6NSEL_C6NCH0_LENGTH                    equ 0001h
CM6NSEL_C6NCH0_MASK                      equ 0001h
CM6NSEL_C6NCH1_POSN                      equ 0001h
CM6NSEL_C6NCH1_POSITION                  equ 0001h
CM6NSEL_C6NCH1_SIZE                      equ 0001h
CM6NSEL_C6NCH1_LENGTH                    equ 0001h
CM6NSEL_C6NCH1_MASK                      equ 0002h
CM6NSEL_C6NCH2_POSN                      equ 0002h
CM6NSEL_C6NCH2_POSITION                  equ 0002h
CM6NSEL_C6NCH2_SIZE                      equ 0001h
CM6NSEL_C6NCH2_LENGTH                    equ 0001h
CM6NSEL_C6NCH2_MASK                      equ 0004h
CM6NSEL_C6NCH3_POSN                      equ 0003h
CM6NSEL_C6NCH3_POSITION                  equ 0003h
CM6NSEL_C6NCH3_SIZE                      equ 0001h
CM6NSEL_C6NCH3_LENGTH                    equ 0001h
CM6NSEL_C6NCH3_MASK                      equ 0008h

// Register: CM6PSEL
#define CM6PSEL CM6PSEL
CM6PSEL                                  equ 0917h
// bitfield definitions
CM6PSEL_PCH_POSN                         equ 0000h
CM6PSEL_PCH_POSITION                     equ 0000h
CM6PSEL_PCH_SIZE                         equ 0004h
CM6PSEL_PCH_LENGTH                       equ 0004h
CM6PSEL_PCH_MASK                         equ 000Fh
CM6PSEL_PCH0_POSN                        equ 0000h
CM6PSEL_PCH0_POSITION                    equ 0000h
CM6PSEL_PCH0_SIZE                        equ 0001h
CM6PSEL_PCH0_LENGTH                      equ 0001h
CM6PSEL_PCH0_MASK                        equ 0001h
CM6PSEL_PCH1_POSN                        equ 0001h
CM6PSEL_PCH1_POSITION                    equ 0001h
CM6PSEL_PCH1_SIZE                        equ 0001h
CM6PSEL_PCH1_LENGTH                      equ 0001h
CM6PSEL_PCH1_MASK                        equ 0002h
CM6PSEL_PCH2_POSN                        equ 0002h
CM6PSEL_PCH2_POSITION                    equ 0002h
CM6PSEL_PCH2_SIZE                        equ 0001h
CM6PSEL_PCH2_LENGTH                      equ 0001h
CM6PSEL_PCH2_MASK                        equ 0004h
CM6PSEL_PCH3_POSN                        equ 0003h
CM6PSEL_PCH3_POSITION                    equ 0003h
CM6PSEL_PCH3_SIZE                        equ 0001h
CM6PSEL_PCH3_LENGTH                      equ 0001h
CM6PSEL_PCH3_MASK                        equ 0008h
CM6PSEL_C6PCH_POSN                       equ 0000h
CM6PSEL_C6PCH_POSITION                   equ 0000h
CM6PSEL_C6PCH_SIZE                       equ 0004h
CM6PSEL_C6PCH_LENGTH                     equ 0004h
CM6PSEL_C6PCH_MASK                       equ 000Fh
CM6PSEL_C6PCH0_POSN                      equ 0000h
CM6PSEL_C6PCH0_POSITION                  equ 0000h
CM6PSEL_C6PCH0_SIZE                      equ 0001h
CM6PSEL_C6PCH0_LENGTH                    equ 0001h
CM6PSEL_C6PCH0_MASK                      equ 0001h
CM6PSEL_C6PCH1_POSN                      equ 0001h
CM6PSEL_C6PCH1_POSITION                  equ 0001h
CM6PSEL_C6PCH1_SIZE                      equ 0001h
CM6PSEL_C6PCH1_LENGTH                    equ 0001h
CM6PSEL_C6PCH1_MASK                      equ 0002h
CM6PSEL_C6PCH2_POSN                      equ 0002h
CM6PSEL_C6PCH2_POSITION                  equ 0002h
CM6PSEL_C6PCH2_SIZE                      equ 0001h
CM6PSEL_C6PCH2_LENGTH                    equ 0001h
CM6PSEL_C6PCH2_MASK                      equ 0004h
CM6PSEL_C6PCH3_POSN                      equ 0003h
CM6PSEL_C6PCH3_POSITION                  equ 0003h
CM6PSEL_C6PCH3_SIZE                      equ 0001h
CM6PSEL_C6PCH3_LENGTH                    equ 0001h
CM6PSEL_C6PCH3_MASK                      equ 0008h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 0D8Eh
// bitfield definitions
PWMEN_MPWM5EN_POSN                       equ 0000h
PWMEN_MPWM5EN_POSITION                   equ 0000h
PWMEN_MPWM5EN_SIZE                       equ 0001h
PWMEN_MPWM5EN_LENGTH                     equ 0001h
PWMEN_MPWM5EN_MASK                       equ 0001h
PWMEN_MPWM6EN_POSN                       equ 0001h
PWMEN_MPWM6EN_POSITION                   equ 0001h
PWMEN_MPWM6EN_SIZE                       equ 0001h
PWMEN_MPWM6EN_LENGTH                     equ 0001h
PWMEN_MPWM6EN_MASK                       equ 0002h
PWMEN_MPWM11EN_POSN                      equ 0002h
PWMEN_MPWM11EN_POSITION                  equ 0002h
PWMEN_MPWM11EN_SIZE                      equ 0001h
PWMEN_MPWM11EN_LENGTH                    equ 0001h
PWMEN_MPWM11EN_MASK                      equ 0004h

