GopalSaraf/Practicals/PSDL/include/proc/pic16f1773.inc
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define PWM5CS0                          BANKMASK(PWM5CLKCON), 0
#define PWM5CS1                          BANKMASK(PWM5CLKCON), 1
#define PWM5CS2                          BANKMASK(PWM5CLKCON), 2
#define PWM5DCH0                         BANKMASK(PWM5DCH), 0
#define PWM5DCH1                         BANKMASK(PWM5DCH), 1
#define PWM5DCH2                         BANKMASK(PWM5DCH), 2
#define PWM5DCH3                         BANKMASK(PWM5DCH), 3
#define PWM5DCH4                         BANKMASK(PWM5DCH), 4
#define PWM5DCH5                         BANKMASK(PWM5DCH), 5
#define PWM5DCH6                         BANKMASK(PWM5DCH), 6
#define PWM5DCH7                         BANKMASK(PWM5DCH), 7
#define PWM5DCIE                         BANKMASK(PWM5INTE), 1
#define PWM5DCIF                         BANKMASK(PWM5INTF), 1
#define PWM5DCL0                         BANKMASK(PWM5DCL), 0
#define PWM5DCL1                         BANKMASK(PWM5DCL), 1
#define PWM5DCL2                         BANKMASK(PWM5DCL), 2
#define PWM5DCL3                         BANKMASK(PWM5DCL), 3
#define PWM5DCL4                         BANKMASK(PWM5DCL), 4
#define PWM5DCL5                         BANKMASK(PWM5DCL), 5
#define PWM5DCL6                         BANKMASK(PWM5DCL), 6
#define PWM5DCL7                         BANKMASK(PWM5DCL), 7
#define PWM5EN                           BANKMASK(PWM5CON), 7
#define PWM5IE                           BANKMASK(PIE6), 0
#define PWM5IF                           BANKMASK(PIR6), 0
#define PWM5LD                           BANKMASK(PWM5LDCON), 7
#define PWM5LDM                          BANKMASK(PWM5LDCON), 6
#define PWM5LDS0                         BANKMASK(PWM5LDCON), 0
#define PWM5LDS1                         BANKMASK(PWM5LDCON), 1
#define PWM5MODE0                        BANKMASK(PWM5CON), 2
#define PWM5MODE1                        BANKMASK(PWM5CON), 3
#define PWM5OFH0                         BANKMASK(PWM5OFH), 0
#define PWM5OFH1                         BANKMASK(PWM5OFH), 1
#define PWM5OFH2                         BANKMASK(PWM5OFH), 2
#define PWM5OFH3                         BANKMASK(PWM5OFH), 3
#define PWM5OFH4                         BANKMASK(PWM5OFH), 4
#define PWM5OFH5                         BANKMASK(PWM5OFH), 5
#define PWM5OFH6                         BANKMASK(PWM5OFH), 6
#define PWM5OFH7                         BANKMASK(PWM5OFH), 7
#define PWM5OFIE                         BANKMASK(PWM5INTE), 3
#define PWM5OFIF                         BANKMASK(PWM5INTF), 3
#define PWM5OFL0                         BANKMASK(PWM5OFL), 0
#define PWM5OFL1                         BANKMASK(PWM5OFL), 1
#define PWM5OFL2                         BANKMASK(PWM5OFL), 2
#define PWM5OFL3                         BANKMASK(PWM5OFL), 3
#define PWM5OFL4                         BANKMASK(PWM5OFL), 4
#define PWM5OFL5                         BANKMASK(PWM5OFL), 5
#define PWM5OFL6                         BANKMASK(PWM5OFL), 6
#define PWM5OFL7                         BANKMASK(PWM5OFL), 7
#define PWM5OFM0                         BANKMASK(PWM5OFCON), 5
#define PWM5OFM1                         BANKMASK(PWM5OFCON), 6
#define PWM5OFMC                         BANKMASK(PWM5OFCON), 4
#define PWM5OFS0                         BANKMASK(PWM5OFCON), 0
#define PWM5OFS1                         BANKMASK(PWM5OFCON), 1
#define PWM5OUT                          BANKMASK(PWM5CON), 5
#define PWM5PHH0                         BANKMASK(PWM5PHH), 0
#define PWM5PHH1                         BANKMASK(PWM5PHH), 1
#define PWM5PHH2                         BANKMASK(PWM5PHH), 2
#define PWM5PHH3                         BANKMASK(PWM5PHH), 3
#define PWM5PHH4                         BANKMASK(PWM5PHH), 4
#define PWM5PHH5                         BANKMASK(PWM5PHH), 5
#define PWM5PHH6                         BANKMASK(PWM5PHH), 6
#define PWM5PHH7                         BANKMASK(PWM5PHH), 7
#define PWM5PHIE                         BANKMASK(PWM5INTE), 2
#define PWM5PHIF                         BANKMASK(PWM5INTF), 2
#define PWM5PHL0                         BANKMASK(PWM5PHL), 0
#define PWM5PHL1                         BANKMASK(PWM5PHL), 1
#define PWM5PHL2                         BANKMASK(PWM5PHL), 2
#define PWM5PHL3                         BANKMASK(PWM5PHL), 3
#define PWM5PHL4                         BANKMASK(PWM5PHL), 4
#define PWM5PHL5                         BANKMASK(PWM5PHL), 5
#define PWM5PHL6                         BANKMASK(PWM5PHL), 6
#define PWM5PHL7                         BANKMASK(PWM5PHL), 7
#define PWM5POL                          BANKMASK(PWM5CON), 4
#define PWM5PRH0                         BANKMASK(PWM5PRH), 0
#define PWM5PRH1                         BANKMASK(PWM5PRH), 1
#define PWM5PRH2                         BANKMASK(PWM5PRH), 2
#define PWM5PRH3                         BANKMASK(PWM5PRH), 3
#define PWM5PRH4                         BANKMASK(PWM5PRH), 4
#define PWM5PRH5                         BANKMASK(PWM5PRH), 5
#define PWM5PRH6                         BANKMASK(PWM5PRH), 6
#define PWM5PRH7                         BANKMASK(PWM5PRH), 7
#define PWM5PRIE                         BANKMASK(PWM5INTE), 0
#define PWM5PRIF                         BANKMASK(PWM5INTF), 0
#define PWM5PRL0                         BANKMASK(PWM5PRL), 0
#define PWM5PRL1                         BANKMASK(PWM5PRL), 1
#define PWM5PRL2                         BANKMASK(PWM5PRL), 2
#define PWM5PRL3                         BANKMASK(PWM5PRL), 3
#define PWM5PRL4                         BANKMASK(PWM5PRL), 4
#define PWM5PRL5                         BANKMASK(PWM5PRL), 5
#define PWM5PRL6                         BANKMASK(PWM5PRL), 6
#define PWM5PRL7                         BANKMASK(PWM5PRL), 7
#define PWM5PS0                          BANKMASK(PWM5CLKCON), 4
#define PWM5PS1                          BANKMASK(PWM5CLKCON), 5
#define PWM5PS2                          BANKMASK(PWM5CLKCON), 6
#define PWM5TMRH0                        BANKMASK(PWM5TMRH), 0
#define PWM5TMRH1                        BANKMASK(PWM5TMRH), 1
#define PWM5TMRH2                        BANKMASK(PWM5TMRH), 2
#define PWM5TMRH3                        BANKMASK(PWM5TMRH), 3
#define PWM5TMRH4                        BANKMASK(PWM5TMRH), 4
#define PWM5TMRH5                        BANKMASK(PWM5TMRH), 5
#define PWM5TMRH6                        BANKMASK(PWM5TMRH), 6
#define PWM5TMRH7                        BANKMASK(PWM5TMRH), 7
#define PWM5TMRL0                        BANKMASK(PWM5TMRL), 0
#define PWM5TMRL1                        BANKMASK(PWM5TMRL), 1
#define PWM5TMRL2                        BANKMASK(PWM5TMRL), 2
#define PWM5TMRL3                        BANKMASK(PWM5TMRL), 3
#define PWM5TMRL4                        BANKMASK(PWM5TMRL), 4
#define PWM5TMRL5                        BANKMASK(PWM5TMRL), 5
#define PWM5TMRL6                        BANKMASK(PWM5TMRL), 6
#define PWM5TMRL7                        BANKMASK(PWM5TMRL), 7
#define PWM6CS0                          BANKMASK(PWM6CLKCON), 0
#define PWM6CS1                          BANKMASK(PWM6CLKCON), 1
#define PWM6CS2                          BANKMASK(PWM6CLKCON), 2
#define PWM6DCH0                         BANKMASK(PWM6DCH), 0
#define PWM6DCH1                         BANKMASK(PWM6DCH), 1
#define PWM6DCH2                         BANKMASK(PWM6DCH), 2
#define PWM6DCH3                         BANKMASK(PWM6DCH), 3
#define PWM6DCH4                         BANKMASK(PWM6DCH), 4
#define PWM6DCH5                         BANKMASK(PWM6DCH), 5
#define PWM6DCH6                         BANKMASK(PWM6DCH), 6
#define PWM6DCH7                         BANKMASK(PWM6DCH), 7
#define PWM6DCIE                         BANKMASK(PWM6INTE), 1
#define PWM6DCIF                         BANKMASK(PWM6INTF), 1
#define PWM6DCL0                         BANKMASK(PWM6DCL), 0
#define PWM6DCL1                         BANKMASK(PWM6DCL), 1
#define PWM6DCL2                         BANKMASK(PWM6DCL), 2
#define PWM6DCL3                         BANKMASK(PWM6DCL), 3
#define PWM6DCL4                         BANKMASK(PWM6DCL), 4
#define PWM6DCL5                         BANKMASK(PWM6DCL), 5
#define PWM6DCL6                         BANKMASK(PWM6DCL), 6
#define PWM6DCL7                         BANKMASK(PWM6DCL), 7
#define PWM6EN                           BANKMASK(PWM6CON), 7
#define PWM6IE                           BANKMASK(PIE6), 1
#define PWM6IF                           BANKMASK(PIR6), 1
#define PWM6LD                           BANKMASK(PWM6LDCON), 7
#define PWM6LDM                          BANKMASK(PWM6LDCON), 6
#define PWM6LDS0                         BANKMASK(PWM6LDCON), 0
#define PWM6LDS1                         BANKMASK(PWM6LDCON), 1
#define PWM6MODE0                        BANKMASK(PWM6CON), 2
#define PWM6MODE1                        BANKMASK(PWM6CON), 3
#define PWM6OFH0                         BANKMASK(PWM6OFH), 0
#define PWM6OFH1                         BANKMASK(PWM6OFH), 1
#define PWM6OFH2                         BANKMASK(PWM6OFH), 2
#define PWM6OFH3                         BANKMASK(PWM6OFH), 3
#define PWM6OFH4                         BANKMASK(PWM6OFH), 4
#define PWM6OFH5                         BANKMASK(PWM6OFH), 5
#define PWM6OFH6                         BANKMASK(PWM6OFH), 6
#define PWM6OFH7                         BANKMASK(PWM6OFH), 7
#define PWM6OFIE                         BANKMASK(PWM6INTE), 3
#define PWM6OFIF                         BANKMASK(PWM6INTF), 3
#define PWM6OFL0                         BANKMASK(PWM6OFL), 0
#define PWM6OFL1                         BANKMASK(PWM6OFL), 1
#define PWM6OFL2                         BANKMASK(PWM6OFL), 2
#define PWM6OFL3                         BANKMASK(PWM6OFL), 3
#define PWM6OFL4                         BANKMASK(PWM6OFL), 4
#define PWM6OFL5                         BANKMASK(PWM6OFL), 5
#define PWM6OFL6                         BANKMASK(PWM6OFL), 6
#define PWM6OFL7                         BANKMASK(PWM6OFL), 7
#define PWM6OFM0                         BANKMASK(PWM6OFCON), 5
#define PWM6OFM1                         BANKMASK(PWM6OFCON), 6
#define PWM6OFMC                         BANKMASK(PWM6OFCON), 4
#define PWM6OFS0                         BANKMASK(PWM6OFCON), 0
#define PWM6OFS1                         BANKMASK(PWM6OFCON), 1
#define PWM6OUT                          BANKMASK(PWM6CON), 5
#define PWM6PHH0                         BANKMASK(PWM6PHH), 0
#define PWM6PHH1                         BANKMASK(PWM6PHH), 1
#define PWM6PHH2                         BANKMASK(PWM6PHH), 2
#define PWM6PHH3                         BANKMASK(PWM6PHH), 3
#define PWM6PHH4                         BANKMASK(PWM6PHH), 4
#define PWM6PHH5                         BANKMASK(PWM6PHH), 5
#define PWM6PHH6                         BANKMASK(PWM6PHH), 6
#define PWM6PHH7                         BANKMASK(PWM6PHH), 7
#define PWM6PHIE                         BANKMASK(PWM6INTE), 2
#define PWM6PHIF                         BANKMASK(PWM6INTF), 2
#define PWM6PHL0                         BANKMASK(PWM6PHL), 0
#define PWM6PHL1                         BANKMASK(PWM6PHL), 1
#define PWM6PHL2                         BANKMASK(PWM6PHL), 2
#define PWM6PHL3                         BANKMASK(PWM6PHL), 3
#define PWM6PHL4                         BANKMASK(PWM6PHL), 4
#define PWM6PHL5                         BANKMASK(PWM6PHL), 5
#define PWM6PHL6                         BANKMASK(PWM6PHL), 6
#define PWM6PHL7                         BANKMASK(PWM6PHL), 7
#define PWM6POL                          BANKMASK(PWM6CON), 4
#define PWM6PRH0                         BANKMASK(PWM6PRH), 0
#define PWM6PRH1                         BANKMASK(PWM6PRH), 1
#define PWM6PRH2                         BANKMASK(PWM6PRH), 2
#define PWM6PRH3                         BANKMASK(PWM6PRH), 3
#define PWM6PRH4                         BANKMASK(PWM6PRH), 4
#define PWM6PRH5                         BANKMASK(PWM6PRH), 5
#define PWM6PRH6                         BANKMASK(PWM6PRH), 6
#define PWM6PRH7                         BANKMASK(PWM6PRH), 7
#define PWM6PRIE                         BANKMASK(PWM6INTE), 0
#define PWM6PRIF                         BANKMASK(PWM6INTF), 0
#define PWM6PRL0                         BANKMASK(PWM6PRL), 0
#define PWM6PRL1                         BANKMASK(PWM6PRL), 1
#define PWM6PRL2                         BANKMASK(PWM6PRL), 2
#define PWM6PRL3                         BANKMASK(PWM6PRL), 3
#define PWM6PRL4                         BANKMASK(PWM6PRL), 4
#define PWM6PRL5                         BANKMASK(PWM6PRL), 5
#define PWM6PRL6                         BANKMASK(PWM6PRL), 6
#define PWM6PRL7                         BANKMASK(PWM6PRL), 7
#define PWM6PS0                          BANKMASK(PWM6CLKCON), 4
#define PWM6PS1                          BANKMASK(PWM6CLKCON), 5
#define PWM6PS2                          BANKMASK(PWM6CLKCON), 6
#define PWM6TMRH0                        BANKMASK(PWM6TMRH), 0
#define PWM6TMRH1                        BANKMASK(PWM6TMRH), 1
#define PWM6TMRH2                        BANKMASK(PWM6TMRH), 2
#define PWM6TMRH3                        BANKMASK(PWM6TMRH), 3
#define PWM6TMRH4                        BANKMASK(PWM6TMRH), 4
#define PWM6TMRH5                        BANKMASK(PWM6TMRH), 5
#define PWM6TMRH6                        BANKMASK(PWM6TMRH), 6
#define PWM6TMRH7                        BANKMASK(PWM6TMRH), 7
#define PWM6TMRL0                        BANKMASK(PWM6TMRL), 0
#define PWM6TMRL1                        BANKMASK(PWM6TMRL), 1
#define PWM6TMRL2                        BANKMASK(PWM6TMRL), 2
#define PWM6TMRL3                        BANKMASK(PWM6TMRL), 3
#define PWM6TMRL4                        BANKMASK(PWM6TMRL), 4
#define PWM6TMRL5                        BANKMASK(PWM6TMRL), 5
#define PWM6TMRL6                        BANKMASK(PWM6TMRL), 6
#define PWM6TMRL7                        BANKMASK(PWM6TMRL), 7
#define PWM9DC0                          BANKMASK(PWM9DCL), 6
#define PWM9DC1                          BANKMASK(PWM9DCL), 7
#define PWM9DC2                          BANKMASK(PWM9DCH), 0
#define PWM9DC3                          BANKMASK(PWM9DCH), 1
#define PWM9DC4                          BANKMASK(PWM9DCH), 2
#define PWM9DC5                          BANKMASK(PWM9DCH), 3
#define PWM9DC6                          BANKMASK(PWM9DCH), 4
#define PWM9DC7                          BANKMASK(PWM9DCH), 5
#define PWM9DC8                          BANKMASK(PWM9DCH), 6
#define PWM9DC9                          BANKMASK(PWM9DCH), 7
#define PWM9EN                           BANKMASK(PWM9CON), 7
#define PWM9OE                           BANKMASK(PWM9CON), 6
#define PWM9OUT                          BANKMASK(PWM9CON), 5
#define PWM9POL                          BANKMASK(PWM9CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define RE3                              BANKMASK(PORTE), 3
#define RG1EN                            BANKMASK(PRG1CON0), 7
#define RG1FEDG                          BANKMASK(PRG1CON0), 5
#define RG1FPOL                          BANKMASK(PRG1CON1), 1
#define RG1FTSS0                         BANKMASK(PRG1FTSS), 0
#define RG1FTSS1                         BANKMASK(PRG1FTSS), 1
#define RG1FTSS2                         BANKMASK(PRG1FTSS), 2
#define RG1FTSS3                         BANKMASK(PRG1FTSS), 3
#define RG1GO                            BANKMASK(PRG1CON0), 0
#define RG1INS0                          BANKMASK(PRG1INS), 0
#define RG1INS1                          BANKMASK(PRG1INS), 1
#define RG1INS2                          BANKMASK(PRG1INS), 2
#define RG1INS3                          BANKMASK(PRG1INS), 3
#define RG1ISET0                         BANKMASK(PRG1CON2), 0
#define RG1ISET1                         BANKMASK(PRG1CON2), 1
#define RG1ISET2                         BANKMASK(PRG1CON2), 2
#define RG1ISET3                         BANKMASK(PRG1CON2), 3
#define RG1ISET4                         BANKMASK(PRG1CON2), 4
#define RG1MODE0                         BANKMASK(PRG1CON0), 2
#define RG1MODE1                         BANKMASK(PRG1CON0), 3
#define RG1OS                            BANKMASK(PRG1CON0), 1
#define RG1RDY                           BANKMASK(PRG1CON1), 2
#define RG1REDG                          BANKMASK(PRG1CON0), 4
#define RG1RPOL                          BANKMASK(PRG1CON1), 0
#define RG1RTSS0                         BANKMASK(PRG1RTSS), 0
#define RG1RTSS1                         BANKMASK(PRG1RTSS), 1
#define RG1RTSS2                         BANKMASK(PRG1RTSS), 2
#define RG1RTSS3                         BANKMASK(PRG1RTSS), 3
#define RG2EN                            BANKMASK(PRG2CON0), 7
#define RG2FEDG                          BANKMASK(PRG2CON0), 5
#define RG2FPOL                          BANKMASK(PRG2CON1), 1
#define RG2FTSS0                         BANKMASK(PRG2FTSS), 0
#define RG2FTSS1                         BANKMASK(PRG2FTSS), 1
#define RG2FTSS2                         BANKMASK(PRG2FTSS), 2
#define RG2FTSS3                         BANKMASK(PRG2FTSS), 3
#define RG2GO                            BANKMASK(PRG2CON0), 0
#define RG2INS0                          BANKMASK(PRG2INS), 0
#define RG2INS1                          BANKMASK(PRG2INS), 1
#define RG2INS2                          BANKMASK(PRG2INS), 2
#define RG2INS3                          BANKMASK(PRG2INS), 3
#define RG2ISET0                         BANKMASK(PRG2CON2), 0
#define RG2ISET1                         BANKMASK(PRG2CON2), 1
#define RG2ISET2                         BANKMASK(PRG2CON2), 2
#define RG2ISET3                         BANKMASK(PRG2CON2), 3
#define RG2ISET4                         BANKMASK(PRG2CON2), 4
#define RG2MODE0                         BANKMASK(PRG2CON0), 2
#define RG2MODE1                         BANKMASK(PRG2CON0), 3
#define RG2OS                            BANKMASK(PRG2CON0), 1
#define RG2RDY                           BANKMASK(PRG2CON1), 2
#define RG2REDG                          BANKMASK(PRG2CON0), 4
#define RG2RPOL                          BANKMASK(PRG2CON1), 0
#define RG2RTSS0                         BANKMASK(PRG2RTSS), 0
#define RG2RTSS1                         BANKMASK(PRG2RTSS), 1
#define RG2RTSS2                         BANKMASK(PRG2RTSS), 2
#define RG2RTSS3                         BANKMASK(PRG2RTSS), 3
#define RG3EN                            BANKMASK(PRG3CON0), 7
#define RG3FEDG                          BANKMASK(PRG3CON0), 5
#define RG3FPOL                          BANKMASK(PRG3CON1), 1
#define RG3FTSS0                         BANKMASK(PRG3FTSS), 0
#define RG3FTSS1                         BANKMASK(PRG3FTSS), 1
#define RG3FTSS2                         BANKMASK(PRG3FTSS), 2
#define RG3FTSS3                         BANKMASK(PRG3FTSS), 3
#define RG3GO                            BANKMASK(PRG3CON0), 0
#define RG3INS0                          BANKMASK(PRG3INS), 0
#define RG3INS1                          BANKMASK(PRG3INS), 1
#define RG3INS2                          BANKMASK(PRG3INS), 2
#define RG3INS3                          BANKMASK(PRG3INS), 3
#define RG3ISET0                         BANKMASK(PRG3CON2), 0
#define RG3ISET1                         BANKMASK(PRG3CON2), 1
#define RG3ISET2                         BANKMASK(PRG3CON2), 2
#define RG3ISET3                         BANKMASK(PRG3CON2), 3
#define RG3ISET4                         BANKMASK(PRG3CON2), 4
#define RG3MODE0                         BANKMASK(PRG3CON0), 2
#define RG3MODE1                         BANKMASK(PRG3CON0), 3
#define RG3OS                            BANKMASK(PRG3CON0), 1
#define RG3RDY                           BANKMASK(PRG3CON1), 2
#define RG3REDG                          BANKMASK(PRG3CON0), 4
#define RG3RPOL                          BANKMASK(PRG3CON1), 0
#define RG3RTSS0                         BANKMASK(PRG3RTSS), 0
#define RG3RTSS1                         BANKMASK(PRG3RTSS), 1
#define RG3RTSS2                         BANKMASK(PRG3RTSS), 2
#define RG3RTSS3                         BANKMASK(PRG3RTSS), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SMP                              BANKMASK(SSP1STAT), 7
